docs/superpowers/reports/evidence/2026-09-09-prd-coverage-workflow/mutation.diff
diff --git a/test_product.py b/test_product.py
index edb7d52..53149d1 100644
--- a/test_product.py
+++ b/test_product.py
@@ -13,7 +13,7 @@ class JsonPreservationTest(unittest.TestCase):
             before = destination.read_bytes()
             with self.assertRaises(ValueError):
                 reject_invalid_json('{"broken":', destination)
-            self.assertEqual(destination.read_bytes(), before)
+            self.assertTrue(destination.exists())
 
 
 if __name__ == "__main__":
